/****************************************************************************
*
*文件名  :  两个变量之间的数据交换
*内容描述: 1、给定两个整型变量的值，将两个值的内容进行交换
*作者    : 梁国庆
*日期	 : 2022/05/09
*
****************************************************************************/
#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

/****************************************************************************
* 函数名: main()
* 功 能: 主函数
* 输 入: 无
* 输 出: 无
****************************************************************************/
int main()
{
	int i = 100, n = 50, j = 0;	/*定义三个变量，并赋初值*/

	printf("初始值：i = %d,n = %d\n\n", i, n);	/*打印初始值*/

	j = i;	/*变量 j 作为中间变量，进行数据交换*/
	i = n;
	n = j;

	printf("转换后：i = %d,n = %d\n", i,n);	/*打印转化后的值*/

	return 0;	/*返回0*/
}
